[
  {
    "id": 1,
    "title": "Nutrition During Pregnancy",
    "summary": "Most women in the United States do not meet recommendations for healthful nutrition and weight before and during pregnancy. A balanced, nutrient-dense diet—rich in fruits, vegetables, whole grains, lean proteins, and healthy fats—supports maternal and infant health.",
    "image": "/assets/placeholder-1.svg",
    "url": "https://www.ajog.org/article/S0002-9378(21)02728-9/fulltext"
  },
  {
    "id": 2,
    "title": "The Top 6 Pregnancy Questions I Hear From First-Time Moms",
    "summary": "Pregnancy brings many physical changes and new symptoms each week; understanding what’s normal can help you feel more confident and prepared. Avoid certain high-risk foods (like unpasteurized dairy, raw or undercooked meat and eggs, and high-mercury fish) and follow food-safety guidance to reduce infection risk.",
    "image": "/assets/placeholder-2.svg",
    "url": "https://www.acog.org/womens-health/experts-and-stories/the-latest/the-top-6-pregnancy-questions-i-hear-from-first-time-moms"
  },
  {
    "id": 3,
    "title": "You Can Have a Healthy Pregnancy With Gestational Diabetes",
    "summary": "“Rochelle” came to me after a new diagnosis: gestational diabetes (also known as GD or GDM). She was anxious about what GD meant for her pregnancy and wondered what had caused it.\n\nDiabetes is a condition in which too much glucose (sugar) stays in the blood instead of being used for energy. GD is a form of diabetes that develops during pregnancy. It is one of the most common pregnancy complications, affecting at least 1 in 20 pregnancies.\n\nAs an ob-gyn who treats high-risk pregnancies, I see women with GD every day. I want to reassure patients like Rochelle that while GD is serious, it’s also manageable.\n\nHere are six questions my patients often ask about GD, and how I answer them.\n\n1. Did my diet cause my GD?\nNo, nothing you ate gave you GD.\n\nTo understand GD, it helps to understand insulin. This is a hormone that helps cells absorb blood sugar. During pregnancy, the placenta produces hormones that can interfere with insulin.",
    "image": "/assets/placeholder-1.svg",
    "url": "https://www.acog.org/womens-health/experts-and-stories/the-latest/you-can-have-a-healthy-pregnancy-with-gestational-diabetes"
  }
]
